examples/rotating_cylinder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pbeTransportFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         9000;

deltaT          0.1;

maxDeltaT       1;


writeControl    runTime;

writeInterval   30000;

purgeWrite      0;

writeFormat     binary;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

suppressSolverInfo yes;

maxCo           0.5;

maxDeltaT       0.1;

functions
{
    probes
    {
        // Where to load it from
        libs            (libsampling);

        type            probes;

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        writeControl   timeStep;
        writeInterval  1;

        // Fields to be probed
        fields
        (
            moment.0.populationBalance
            moment.1.populationBalance
            moment.2.populationBalance
            moment.3.populationBalance
            moment.4.populationBalance
			C
			T
        );

        probeLocations
        (
            ( 0 0 0.015 )
        );
    }
}

libs
(
    "libcrystalGrowthModels.so"
);

// ************************************************************************* //
