examples/rotating_cylinder/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.001;

// geometry
radius 40;
inner 16.0;
height 70;

vertices
(
    (16.0 0.0 0)
    (0.0 16.0 0)
    (-16.0 0.0 0)
    (0.0 -16.0 0)
    (40 0.0 0)
    (0.0 40 0)
    (-40 0.0 0)
    (0.0 -40 0)
    (16.0 0.0 70)
    (0.0 16.0 70)
    (-16.0 0.0 70)
    (0.0 -16.0 70)
    (40 0.0 70)
    (0.0 40 70)
    (-40 0.0 70)
    (0.0 -40 70)
);

blocks
(
    hex (0 1 2 3 8 9 10 11) (12 12 24) simpleGrading (1 1 1)
    hex (0 4 5 1 8 12 13 9) (12 12 24) simpleGrading (1 1 1)
    hex (1 5 6 2 9 13 14 10) (12 12 24) simpleGrading (1 1 1)
    hex (2 6 7 3 10 14 15 11) (12 12 24) simpleGrading (1 1 1)
    hex (3 7 4 0 11 15 12 8) (12 12 24) simpleGrading (1 1 1)
);

edges
(
    arc 4 5 (28.284271247461902 28.284271247461902 0)
    arc 5 6 (-28.284271247461902 28.284271247461902 0)
    arc 6 7 (-28.284271247461902 -28.284271247461902 0)
    arc 7 4 (28.284271247461902 -28.284271247461902 0)
    arc 12 13 (28.284271247461902 28.284271247461902 70)
    arc 13 14 (-28.284271247461902 28.284271247461902 70)
    arc 14 15 (-28.284271247461902 -28.284271247461902 70)
    arc 15 12 (28.284271247461902 -28.284271247461902 70)
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (3 7 4 0)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (11 10 9 8)
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
            (11 8 12 15)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (4 12 13 5)
            (5 13 14 6)
            (6 14 15 7)
            (7 15 12 4)
        );
    }
);

mergePatchPairs ();
