examples/rotating_cylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
		type        codedFixedValue;
		value       uniform (0 0 0);
		name        rotatingCylinderWall;
    }
    bottom
    {
		type        codedFixedValue;
		value       uniform (0 0 0);
		name        rotatingCylinderWall;
    }
    wall
    {
		type        codedFixedValue;
		value       uniform (0 0 0);
		name        rotatingCylinderWall;
    }
}

// ************************************************************************* //
