examples/rotating_cylinder/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 308.15;

boundaryField
{
	top
	{
		type        codedFixedValue;
		value       uniform 308.15;
		name        coolingWall;
	}
	bottom 
	{
		type codedFixedValue;
		name coolingWall;
		value uniform 308;

	}
	wall
	{
		type codedFixedValue;
		name coolingWall;
		value uniform 308;
	}
}


// ************************************************************************* //
