examples/rotating_cylinder/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	top
	{
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
	}
	bottom 
	{
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
	}
	wall
	{
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
	}
}


// ************************************************************************* //
