examples/rotating_cylinder/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-6;

boundaryField
{
	top
	{
        type            epsilonWallFunction;
        value           uniform 1e-6;
	}
	bottom 
	{
        type            epsilonWallFunction;
        value           uniform 1e-6;
	}
	wall
	{
        type            epsilonWallFunction;
        value           uniform 1e-6;
	}
}


// ************************************************************************* //
